Revit 2024 API
Pipe.IsPlaceholder Property
 Identifies if the pipe is a placeholder or not.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsPlaceholder { get; }
Visual Basic
Public ReadOnly Property IsPlaceholder As Boolean
	Get
Visual C++
public:
property bool IsPlaceholder {
	bool get ();
}
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace